app/views/users/show.html.erb

  <h3>Most recent posts:</h3>
  <% @user.recent_posts.each do |post| %>
---
SELECT "posts".* FROM "posts"