app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" = $1 ORDER BY "comments"."created_at" DESC  [["posts_id", 5]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."posts_id" = $1  [["posts_id", 5]]
---
        <h4>Comments:</h4>
          <%= post.five_recent_comments.length %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <% if single_comment.post_id == post.id %>
            <% commentor = User.find_by(id: single_comment.author_id) %>