app/controllers/posts_controller.rb

  def show
    @comments = Comment.all.order(created_at: :desc)
    @post = Post.find_by(author_id: params[:user_id], id: params[:id])
    @user = User.find_by(id: params[:user_id])
    @users = User.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    @post = Post.new(author_id: params[:user_id], title: params[:title], text: params[:text])
    redirect_back(fallback_location: root_path)
    flash.alert = if @post.save
---
INSERT INTO "posts" ("title", "text", "CommentsCounter", "created_at", "updated_at", "author_id", "likes_counter") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "sdaaa"], ["text", "ssss"], ["CommentsCounter", nil], ["created_at", "2022-02-16 22:13:41.738304"], ["updated_at", "2022-02-16 22:13:41.738304"], ["author_id", 1], ["likes_counter", nil]]