app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" = $1 ORDER BY "comments"."created_at" DESC  [["posts_id", 5]]
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "comments" WHERE "comments"."posts_id" = $1  [["posts_id", 5]]
UPDATE "posts" SET "CommentsCounter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["CommentsCounter", 0], ["updated_at", "2022-02-16 22:13:41.892236"], ["id", 7]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."posts_id" = $1  [["posts_id", 5]]
UPDATE "posts" SET "updated_at" = $1, "likes_counter" = $2 WHERE "posts"."id" = $3  [["updated_at", "2022-02-16 22:13:41.901875"], ["likes_counter", 0], ["id", 7]]
---
  def index
    @params = params
    @user = User.find_by(id: params[:user_id])
    @posts = Post.limit(2).where(author_id: params[:user_id])
    @comments = Comment.all.order(created_at: :desc)

    Post.all.each do |post|
      post.update(CommentsCounter: Comment.where(posts_id: post.id).count)
      post.update(likes_counter: Like.where(posts_id: post.id).count)

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["author_id", 1], ["LIMIT", 3]]
SELECT "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
UPDATE "users" SET "PostsCounter" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["PostsCounter", 5], ["updated_at", "2022-02-15 21:07:40.080537"], ["id", 1]]
---
  def show
    @recent_posts = Post.limit(3).where(author_id: params[:id]).order(created_at: :desc)
    @comments = Comment.all.order(created_at: :desc)
    @current_user = User.find_by(id: params[:id])
    @current_user.update(PostsCounter: Post.where(author_id: @current_user.id).count)