app/controllers/users_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" = $1 ORDER BY "comments"."created_at" DESC  [["posts_id", 5]]
---
  def show
    Post.all.each do |post|
      post.update(CommentsCounter: Comment.where(posts_id: post.id).count)
      post.update(likes_counter: Like.where(posts_id: post.id).count)
    end
    @total_posts = Post.all.where(author_id: params[:id]).count
    @likes = Like.all
    @comments = Comment.all.order(created_at: :desc)