app/controllers/users_controller.rb

  def show
    Post.all.each do |post|
      post.update(CommentsCounter: Comment.where(posts_id: post.id).count)
      post.update(likes_counter: Like.where(posts_id: post.id).count)
    end

    @recent_posts = Post.limit(6).where(author_id: params[:id]).order(created_at: :desc)
    @comments = Comment.all.order(created_at: :desc)
    @current_user = User.find_by(id: params[:id])
    @current_user.update(PostsCounter: Post.where(author_id: @current_user.id).count)
---
SELECT "posts".* FROM "posts"
UPDATE "posts" SET "CommentsCounter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["CommentsCounter", 0], ["updated_at", "2022-02-15 16:39:22.025181"], ["id", 5]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."posts_id" = $1  [["posts_id", 5]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."posts_id" = $1  [["posts_id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 ORDER BY "posts"."created_at" DESC  [["author_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = $1, "likes_counter" = $2 WHERE "posts"."id" = $3  [["updated_at", "2022-02-16 19:42:19.791620"], ["likes_counter", 0], ["id", 6]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
UPDATE "users" SET "PostsCounter" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["PostsCounter", 5], ["updated_at", "2022-02-15 20:23:16.059683"], ["id", 1]]